src/main/resources/request

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:gs="http://spring.io/guides/gs-producing-web-service">
  <soapenv:Header/>
  <soapenv:Body>
    <gs:getInovicesRequest>
      <gs:id>1</gs:id>
    </gs:getInovicesRequest>
  </soapenv:Body>
</soapenv:Envelope>

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:gs="http://spring.io/guides/gs-producing-web-service">
<soapenv:Header/>
<soapenv:Body>
  <gs:getAllInvoicesRequest>
  </gs:getAllInvoicesRequest>
</soapenv:Body>
</soapenv:Envelope>

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
<SOAP-ENV:Header/>
<SOAP-ENV:Body>
  <ns2:getInvoicesResponse xmlns:ns2="http://spring.io/guides/gs-producing-web-service">
    <ns2:invoice>
      <ns2:xId>1</ns2:xId>
      <ns2:xAmount>200.00</ns2:xAmount>
      <ns2:xVatAmount>55.00</ns2:xVatAmount>
      <ns2:xSeller>
        <ns2:xId>1</ns2:xId>
        <ns2:xName>string</ns2:xName>
        <ns2:xTaxIdentificationNumber>string</ns2:xTaxIdentificationNumber>
      </ns2:xSeller>
      <ns2:xBuyer>
        <ns2:xId>1</ns2:xId>
        <ns2:xName>string</ns2:xName>
        <ns2:xTaxIdentificationNumber>string</ns2:xTaxIdentificationNumber>
      </ns2:xBuyer>
      <ns2:xEntreis>
        <ns2:id>1</ns2:id>
        <ns2:desc>asdfasdf1</ns2:desc>
        <ns2:vatRate>20</ns2:vatRate>
        <ns2:amount>50.00</ns2:amount>
        <ns2:vatAmount>10.00</ns2:vatAmount>
      </ns2:xEntreis>
      <ns2:xEntreis>
        <ns2:id>2</ns2:id>
        <ns2:desc>asdfasdf2</ns2:desc>
        <ns2:vatRate>30</ns2:vatRate>
        <ns2:amount>150.00</ns2:amount>
        <ns2:vatAmount>45.00</ns2:vatAmount>
      </ns2:xEntreis>
    </ns2:invoice>
  </ns2:getInvoicesResponse>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>